Repository: lwhsu/freebsd-docng
Catalog: *.ISO8859-1/articles/leap-seconds/*.po
Languages: de_de

# _
source: translator-credits
de_de: bcr@freebsd.org, 2015

source: FreeBSD Support for Leap Seconds
de_de: Unterstützung für Schaltsekunden in FreeBSD

source: Introduction
de_de: Einleitung

source: A <emphasis>leap second</emphasis> is an ad-hoc one-second correction to synchronize atomic timescales with Earth rotation. This article describes how FreeBSD interacts with leap seconds.
de_de: Eine <emphasis>Schaltsekunde</emphasis> ist eine eigens dazu eingerichtete Korrektur, um die atomaren Zeitskalen mit der Erdrotation zu synchronisieren. Dieser Artikel beschreibt wie FreeBSD mit Schaltsekunden umgeht.

source: As of this writing, the next leap second will occur at 2015-Jun-30 23:59:60 UTC. This leap second will occur during a business day for North and South America and the Asia/Pacific region.
de_de: Zum Zeitpunkt der Erstellung dieses Dokuments wird die nächste Schaltsekunde am 30. Juni 2015 um 23:59:60 UTC auftreten. Diese Schaltsekunde wird während eines Arbeitstages für Nord- und Südamerika, sowie die Asien/Pazifik-Region stattfinden.

source: Leap seconds are announced by <link xlink:href="http://datacenter.iers.org/"><acronym>IERS</acronym></link> on <link xlink:href="http://datacenter.iers.org/web/guest/bulletins/-/somos/5Rgv/product/16">Bulletin C</link>.
de_de: Schaltsekunden werden durch den <link xlink:href="http://datacenter.iers.org/"><acronym>IERS</acronym></link> im <link xlink:href="http://datacenter.iers.org/web/guest/bulletins/-/somos/5Rgv/product/16">Bulletin C</link> angekündigt.

source: Standard leap second behavior is described in <link xlink:href="https://tools.ietf.org/html/rfc7164#section-3">RFC 7164</link>. Also see <citerefentry><refentrytitle>time2posix</refentrytitle><manvolnum>3</manvolnum></citerefentry>.
de_de: Das normale Verhalten für Schaltsekunden wird in <link xlink:href="https://tools.ietf.org/html/rfc7164#section-3">RFC 7164</link> beschrieben. Lesen Sie auch <citerefentry><refentrytitle>time2posix</refentrytitle><manvolnum>3</manvolnum></citerefentry>.

source: Default Leap Second Handling on FreeBSD
de_de: Handhabung von gewöhnlichen Schaltsekunden in FreeBD

source: The easiest way to handle leap seconds is with the <acronym>POSIX</acronym> time rules FreeBSD uses by default, combined with <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-ntp.html"><acronym>NTP</acronym></link>. When <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> is running and the time is synchronized with upstream <acronym>NTP</acronym> servers that handle leap seconds correctly, the leap second will cause the system time to automatically repeat the last second of the day. No other adjustments are necessary.
de_de: Die einfachste Art, mit Schaltsekunden umzugehen, ist, die <acronym>POSIX</acronym> Zeitregeln, welche FreeBSD standardmässig verwendet, sowie <link xlink:href="@@URL_RELPREFIX@@/doc/de_DE.ISO8859-1/books/handbook/network-ntp.html"><acronym>NTP</acronym></link> zu benutzen. Wenn <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> läuft und die Uhrzeit mit einem vorgeschalteten <acronym>NTP</acronym>-Server, welcher Schaltsekunden richtig handhabt, abgeglichen wird, passt das System die Uhrzeit automatisch so an, dass die letzte Sekunde des Tages wiederholt wird. Es sind keine weiteren Anpassungen nötig.

source: If the upstream <acronym>NTP</acronym> servers do not handle leap seconds correctly, <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> will step the time by one second after the errant upstream server has noticed and stepped itself.
de_de: Sollte der vorgeschaltete <acronym>NTP</acronym>-Server Schaltsekunden nicht korrekt handhaben, wird <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> die Uhrzeit um eine Sekunde anpassen nachdem der fehlerhafte Server dies bemerkt hat und seine Uhr selbst neu einstellt.

source: If <acronym>NTP</acronym> is not being used, manual adjustment of the system clock will be required after the leap second has passed.
de_de: Wenn <acronym>NTP</acronym> nicht verwendet wird muss die Systemuhr manuell eingestellt werden, nachdem die Schaltsekunde vorbei ist.

source: Cautions
de_de: Vorsichtshinweise

source: Leap seconds are inserted at the same instant all over the world: <acronym>UTC</acronym> midnight. In Japan that is mid-morning, in the Pacific mid-day, in the Americas late afternoon, and in Europe at night.
de_de: Schaltsekunden werden im gleichen Augenblick weltweit eingestellt: Mitternacht <acronym>UTC</acronym>. In Japan ist das in der Morgenmitte, im Pazifik am Mittag, in Nord-, Mittel- und Südamerika am späten Nachmittag und in Europa nachts.

source: We believe and expect that FreeBSD, if provided correct and stable <acronym>NTP</acronym> service, will work as designed during this leap second, as it did during the previous ones.
de_de: Wir glauben und erwarten dass FreeBSD, sofern es mit einem korrekten und stabilen <acronym>NTP</acronym>-Dienst versorgt wird, wie erwartet funktionieren wird, genauso wie es das während der bisherigen Schaltsekunden auch getan hat.

source: However, we caution that practically no applications have ever asked the kernel about leap seconds. Our experience is that, as designed, leap seconds are essentially a replay of the second before the leap second, and this is a surprise to most application programmers.
de_de: Jedoch weisen wir darauf hin, dass praktisch keine Anwendung jemals den Kernel zu Schaltsekunden angefragt hat. Unsere Erfahrung ist, dass Schaltsekunden, so wie sie entwickelt wurden, einfach nur eine Wiederholung der Sekunde vor der Schaltsekunde sind und dies eine Überraschung für die meisten Anwendungsentwickler darstellt.

source: Other operating systems and other computers may or may not handle the leap-second the same way as FreeBSD, and systems without correct and stable <acronym>NTP</acronym> service will not know anything about leap seconds at all.
de_de: Andere Betriebssysteme und andere Computer behandeln die Schaltsekunde wie FreeBSD oder auch nicht und Systeme ohne einen korrekten und stabilen <acronym>NTP</acronym>-Dienst werden gar nichts über Schaltsekunden wissen.

source: It is not unheard of for computers to crash because of leap seconds, and experience has shown that a large fraction of all public <acronym>NTP</acronym> servers might handle and announce the leap second incorrectly.
de_de: Es ist kein ungewöhnlicher Zustand, wenn Computer wegen Schaltsekunden abstürzen und die Erfahrung hat gezeigt, dass eine grosse Menge von allen öffentlichen <acronym>NTP</acronym>-Servern die Schaltsekunde falsch behandeln oder ankündigen.

source: Please try to make sure nothing horrible happens because of the leap second.
de_de: Bitte stellen Sie sicher, dass nichts schreckliches wegen der Schaltsekunde passieren kann.

source: Testing
de_de: Überprüfen

source: It is possible to test whether a leap second will be used. Due to the nature of <acronym>NTP</acronym>, the test might work up to 24 hours before the leap second. Some major reference clock sources only announce leap seconds one hour ahead of the event. Query the <acronym>NTP</acronym> daemon:
de_de: Es ist möglich, zu überprüfen, ob eine Schaltsekunde verwendet wird. Aufgrund der Art und Weise wie <acronym>NTP</acronym> arbeitet, funktioniert der Test möglicherweise bis zu 24 Stunden vor der Schaltsekunde. Manche Hauptreferenzuhrzeitquellen kündigen Schaltsekunden erst eine Stunde vor dem Ereignis an. Fragen Sie den <acronym>NTP</acronym>-Dienst ab:

source: Output that includes <literal>leap_add_sec</literal> indicates proper support of the leap second. Before the 24 hours leading up to the leap second, or after the leap second has passed, <literal>leap_none</literal> will be shown.
de_de: Ausgaben, die <literal>leap_add_sec</literal> beinhalten zeigen die korrekte Unterstützung für Schaltsekunden an. Vor den 24 Stunden, welche vor der Schaltsekunde liegen oder wenn diese vorüber ist, wird <literal>leap_none</literal> angezeigt.

source: Conclusion
de_de: Fazit

source: In practice, leap seconds are usually not a problem on FreeBSD. We hope that this overview helps clarify what to expect and how to make the leap second event proceed more smoothly.
de_de: In der Praxis sind Schaltsekunden kein Problem für FreeBSD. Wir hoffen, dass dieser Überblick dabei geholfen hat, zu klären, was zu erwarten ist und wie das Ereignis der Schaltsekunde einfacher gehandhabt werden kann.
